## Pandas - Panal data analysis

2 data structures are:

a. Series

    Properties:
        a. 1-D
        b. Homogenous
        c. Broadcasting is allowed
        d. Vectorization is allowed
        
    Creation:
        a. using pd.Series() -> raw python data structure
        b. We can import data from a file
        c. We can create individual series from a dataframe.
        
    Metadata inspection:
        a. ndim - shows dimensions
        b. nbytes - shows memory size
        c. dtype - shows data type
        d. shape - shows shape
        e. size - shows no. of elements
        f. info - basic information about data - column
        
    Data inspection:
        a. head - top 5 rows TOP/LIMIT
        b. tail - bottom 5 rows
        c. describe - Five Point summary in descriptive stats
        d. quantile
        e. count
        f. min
        g. max
        h. mean
        i. sum
        
        
b. DataFrame
    
    Properties:
        a. 2-D
        b. Hetrogenous
        c. Broadcasting is allowed
        d. Vectorization is allowed 
    
    Creation:
        a. pd.DataFrame - raw python data structure
        b. Reading table
            I. from a file - text/csv/tsv/excel - read_csv, read_excel, read_parquet, read_json, read_xml, read_sas, read_sql - odbc connection
            II. Connection with the database server is alsow possible
            III. Web based data from a url
        c. By combining multiple series.
        
     
             
    Metadata inspection:
        a. ndim
        b. nbytes
        c. dtype
        d. shape
        e. size
        f. info - basic information about data - column
        g. columns
        
    Data inspection:
        a. head - top 5 rows TOP/LIMIT
        b. tail - bottom 5 rows
        c. sample - random rows
        d. describe - Five Point summary in descriptive stats
        e. quantile
        f. count
        g. min
        h. max
        i. mean
        j. sum
        k. duplicated
        l. value_counts
        
        
        
Indexes are 2 types:
    a. (DI) Default indexes - Can't be changed. Their values will always be in between 0 and rows-1
        -> will be accessible via slicing
    b. UDI (Used defined index) - Can be changed according to the used.
        -> can be provided directly

Properties to address indexes:
.loc - UDI - indexing/filtering is allowed
.iloc - DI - indexing/filtering isn't possible with .iloc

!pip install pandas to install the pandas

In [19]:
import pandas as pd #importing pandas

dt = pd.read_csv('Used_bikes.csv') #reading the csv file

In [20]:
dt.head() #return top 5 data

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [21]:
dt.tail() #return top 5 data

,bike_name,price,city,kms_driven,owner,age,power,brand
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [22]:
print(dt.shape ,dt.size ,type(dt)) #return shape , size and type of the dataset

(32648, 8) 261184 <class 'pandas.core.frame.DataFrame'>

In [23]:
dt.info() #returns all the information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [8]:
#lets create a dataframe
import numpy as np

In [24]:
db = {"Name":['Ritu','Taniya','abhishek','tanmay','mayank'],
     "Branch":['it','cse','it','ece','cse'],
     "Class":[2,3,4,1,2], 
     "City":['jaipur','agra','vridavan','mathura','gokul']}
db

{'Name': ['Ritu', 'Taniya', 'abhishek', 'tanmay', 'mayank'],
 'Branch': ['it', 'cse', 'it', 'ece', 'cse'],
 'Class': [2, 3, 4, 1, 2],
 'City': ['jaipur', 'agra', 'vridavan', 'mathura', 'gokul']}

In [25]:
df = pd.DataFrame(db)
df  #.DataFrame are used to create dataframes

       Name Branch  Class      City
0      Ritu     it      2    jaipur
1    Taniya    cse      3      agra
2  abhishek     it      4  vridavan
3    tanmay    ece      1   mathura
4    mayank    cse      2     gokul

In [26]:
#for fetching name(series)
df['Name']

0        Ritu
1      Taniya
2    abhishek
3      tanmay
4      mayank
Name: Name, dtype: object

In [27]:
# for multiple series
df[['City','Name','Branch']]

       City      Name Branch
0    jaipur      Ritu     it
1      agra    Taniya    cse
2  vridavan  abhishek     it
3   mathura    tanmay    ece
4     gokul    mayank    cse

In [28]:
#for fetching any values 
df[1:3] #start : end :step

       Name Branch  Class      City
1    Taniya    cse      3      agra
2  abhishek     it      4  vridavan

In [29]:
df[['Name','Branch']][1:3][0:2]

       Name Branch
1    Taniya    cse
2  abhishek     it

In [34]:
df.loc[1:3,['Name','Branch']] #fetch data without index

       Name Branch
1    Taniya    cse
2  abhishek     it
3    tanmay    ece

In [39]:
df.iloc[1:4,:2] #fetch data with index

       Name Branch
1    Taniya    cse
2  abhishek     it
3    tanmay    ece

In [40]:
dt

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [41]:
#for total no. unique classes
dt['brand'].nunique()

23

In [43]:
#for total unique classes with name
dt['brand'].unique()

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [45]:
#for check the no. of times each values appeared in the data
dt['brand'].value_counts()

brand
Bajaj              11213
Hero                6368
Royal Enfield       4178
Yamaha              3916
Honda               2108
Suzuki              1464
TVS                 1247
KTM                 1077
Harley-Davidson      737
Kawasaki              79
Hyosung               64
Benelli               56
Mahindra              55
Triumph               26
Ducati                22
BMW                   16
Jawa                  10
MV                     4
Indian                 3
Ideal                  2
Rajdoot                1
LML                    1
Yezdi                  1
Name: count, dtype: int64

In [46]:
bullet = dt[dt['brand'] == "Royal Enfield"]    # can only store specified brand

In [47]:
bullet.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield
23,Royal Enfield Classic Chrome 500cc,121700.0,Kalyan,24520.0,First Owner,5.0,500.0,Royal Enfield
36,Royal Enfield Classic 350cc,98800.0,Kochi,39000.0,First Owner,5.0,350.0,Royal Enfield

In [50]:
#to find:
# brand = royal enfield 
# age == less than 2 year  
# owner == First Owner 


bullete = dt[(dt['brand']=="Royal Enfield") & (dt['age']<=2) & (dt['owner'] == "First Owner")]
bullet.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield
23,Royal Enfield Classic Chrome 500cc,121700.0,Kalyan,24520.0,First Owner,5.0,500.0,Royal Enfield
36,Royal Enfield Classic 350cc,98800.0,Kochi,39000.0,First Owner,5.0,350.0,Royal Enfield

In [51]:
#we can also use condtion like this:
bike = dt[(dt['brand'] == "KTM") | (dt['brand']=="Jawa") ]
if "Jaipur" in bike['city'].unique():
    print('Present')
else: 
    print("not present")

Present

In [55]:
dt.duplicated().sum()    #return sum of all duplicates   == >  25324

25324

In [56]:
#dt.drop_duplicates(inplace=True) this is use to delete the duplicates value from the dataset for real

In [57]:
bullet.sort_values(by="price") #sort the price in ascending

,bike_name,price,city,kms_driven,owner,age,power,brand
7419,Royal Enfield Thunderbird 350cc,33500.0,Delhi,49463.0,First Owner,16.0,350.0,Royal Enfield
5811,Royal Enfield Thunderbird 350cc,33500.0,Delhi,49463.0,First Owner,16.0,350.0,Royal Enfield
7038,Royal Enfield Bullet Electra 350cc,35000.0,Delhi,60000.0,Fourth Owner Or More,18.0,350.0,Royal Enfield
9311,Royal Enfield Thunderbird 350cc,35800.0,Bangalore,90408.0,Third Owner,18.0,350.0,Royal Enfield
9183,Royal Enfield Thunderbird 350cc,35800.0,Bangalore,90408.0,Third Owner,18.0,350.0,Royal Enfield
...,...,...,...,...,...,...,...,...
1931,Royal Enfield Interceptor 650cc,270000.0,Ahmedabad,6500.0,First Owner,2.0,650.0,Royal Enfield
2228,Royal Enfield Interceptor 650cc,280000.0,Mumbai,5000.0,First Owner,2.0,650.0,Royal Enfield
2250,Royal Enfield Interceptor 650cc,280000.0,Mumbai,5000.0,First Owner,2.0,650.0,Royal Enfield
277,Royal Enfield Interceptor 650cc,280000.0,Bangalore,1500.0,First Owner,2.0,650.0,Royal Enfield
4912,Royal Enfield Continental GT 650cc,285000.0,Hyderabad,4500.0,First Owner,2.0,650.0,Royal Enfield

In [58]:
bullet.sort_values(by="price",ascending=False) #decending

,bike_name,price,city,kms_driven,owner,age,power,brand
4912,Royal Enfield Continental GT 650cc,285000.0,Hyderabad,4500.0,First Owner,2.0,650.0,Royal Enfield
277,Royal Enfield Interceptor 650cc,280000.0,Bangalore,1500.0,First Owner,2.0,650.0,Royal Enfield
2228,Royal Enfield Interceptor 650cc,280000.0,Mumbai,5000.0,First Owner,2.0,650.0,Royal Enfield
2250,Royal Enfield Interceptor 650cc,280000.0,Mumbai,5000.0,First Owner,2.0,650.0,Royal Enfield
1931,Royal Enfield Interceptor 650cc,270000.0,Ahmedabad,6500.0,First Owner,2.0,650.0,Royal Enfield
...,...,...,...,...,...,...,...,...
9183,Royal Enfield Thunderbird 350cc,35800.0,Bangalore,90408.0,Third Owner,18.0,350.0,Royal Enfield
9311,Royal Enfield Thunderbird 350cc,35800.0,Bangalore,90408.0,Third Owner,18.0,350.0,Royal Enfield
7038,Royal Enfield Bullet Electra 350cc,35000.0,Delhi,60000.0,Fourth Owner Or More,18.0,350.0,Royal Enfield
7419,Royal Enfield Thunderbird 350cc,33500.0,Delhi,49463.0,First Owner,16.0,350.0,Royal Enfield
5811,Royal Enfield Thunderbird 350cc,33500.0,Delhi,49463.0,First Owner,16.0,350.0,Royal Enfield

In [59]:
jaipur_bullet = bullet[bullet['city']=='Jaipur']
jaipur_bullet.to_csv('jaipur_bullet.csv',index=False)  # export into csv file

In [60]:
data = {'A':[2,5,np.nan,8,np.nan,9],
       'B':[np.nan,45,np.nan,89,63,np.nan], 
       'C':[np.nan,74,np.nan,np.nan,85,4], 
       'D':[10,20,30,40,50,60]}

df2 = pd.DataFrame(data)
df2.dropna()   ## by default remove all those rows that containg
# missing values

     A     B     C   D
1  5.0  45.0  74.0  20

In [61]:
df2.dropna(axis='columns') #remove columns

    D
0  10
1  20
2  30
3  40
4  50
5  60

In [62]:
df2.isnull().sum()
#returns the rows with no. of null values they contain

A    2
B    3
C    3
D    0
dtype: int64

In [63]:
## filling the records 
df2.fillna(500)  # inplace=True

       A      B      C   D
0    2.0  500.0  500.0  10
1    5.0   45.0   74.0  20
2  500.0  500.0  500.0  30
3    8.0   89.0  500.0  40
4  500.0   63.0   85.0  50
5    9.0  500.0    4.0  60

In [65]:

brand_group = dt.groupby('brand')
brand_group

In [66]:
brand_group.get_group('Triumph') #groups the brand triumph

,bike_name,price,city,kms_driven,owner,age,power,brand
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
93,Triumph Street Triple 765,790000.0,Mumbai,19000.0,First Owner,3.0,765.0,Triumph
284,Triumph Street Triple ABS 675cc,599999.0,Mumbai,7800.0,Third Owner,5.0,675.0,Triumph
614,Triumph Speed Triple 1050cc,750000.0,Koppal,9500.0,First Owner,4.0,1050.0,Triumph
1319,Triumph Tiger 800 XRX,750000.0,Delhi,10000.0,First Owner,6.0,800.0,Triumph
1362,Triumph Thunderbird Storm 1700cc,700000.0,Guwahati,176.0,First Owner,5.0,1700.0,Triumph
1375,Triumph Tiger 800 XCA,1300000.0,Ludhiana,9500.0,First Owner,4.0,800.0,Triumph
1440,Triumph Tiger 800 XCA,1300000.0,Ludhiana,9500.0,First Owner,4.0,800.0,Triumph
1867,Triumph Street Twin 900cc,790000.0,Delhi,2500.0,First Owner,3.0,900.0,Triumph
1927,Triumph Street Triple 765,860000.0,Udaipur,2100.0,First Owner,3.0,765.0,Triumph
1998,Triumph Street Triple 765,860000.0,Udaipur,2100.0,First Owner,3.0,765.0,Triumph
2107,Triumph Street Twin 900cc,790000.0,Delhi,2500.0,First Owner,3.0,900.0,Triumph
2157,Triumph Tiger 800 XR,1170000.0,Pune,31500.0,First Owner,5.0,800.0,Triumph
2244,Triumph Bonneville T100 865cc,550000.0,Bangalore,25536.0,First Owner,7.0,865.0,Triumph
3007,Triumph Thruxton R 1200cc,1000000.0,Delhi,1500.0,First Owner,4.0,1200.0,Triumph
3054,Triumph Thruxton R 1200cc,1000000.0,Delhi,1500.0,First Owner,4.0,1200.0,Triumph
3095,Triumph Street Triple ABS 675cc,650000.0,Mumbai,16000.0,First Owner,4.0,675.0,Triumph
3138,Triumph Bonneville T100 900cc,640000.0,Delhi,7500.0,Second Owner,4.0,900.0,Triumph
4597,Triumph Bonneville T100 865cc,500000.0,Delhi,5600.0,Second Owner,6.0,865.0,Triumph
4662,Triumph Bonneville T100 865cc,500000.0,Delhi,5600.0,Second Owner,6.0,865.0,Triumph
4828,Triumph Thruxton R 1200cc,950000.0,Delhi,4600.0,First Owner,4.0,1200.0,Triumph
4917,Triumph Speed Triple 1050cc,900000.0,Bangalore,8000.0,Second Owner,5.0,1050.0,Triumph
6793,Triumph Street Triple 765,789000.0,Pune,13000.0,First Owner,4.0,765.0,Triumph
6794,Triumph Tiger 800 XCA,1200000.0,Hyderabad,25800.0,First Owner,4.0,800.0,Triumph
6795,Triumph Street Triple 765,875000.0,Rajkot,750.0,First Owner,2.0,765.0,Triumph
7621,Triumph Daytona 675 ABS,699000.0,Delhi,9000.0,Third Owner,5.0,675.0,Triumph

In [68]:
brand_group['price'].agg(min_price='min',max_price='max',avg_price='mean') #price are returned wrt brand

                 min_price  max_price     avg_price
brand
BMW               255000.0  1800000.0  5.987500e+05
Bajaj               6400.0   195000.0  4.833127e+04
Benelli           110700.0   785000.0  2.942000e+05
Ducati            380000.0  1500000.0  9.355455e+05
Harley-Davidson   250000.0  1100000.0  4.529988e+05
Hero                5000.0   104000.0  2.382945e+04
Honda              10000.0   800000.0  5.923047e+04
Hyosung           120000.0   493500.0  2.491678e+05
Ideal             100000.0   100000.0  1.000000e+05
Indian            700000.0  1900000.0  1.100000e+06
Jawa              146000.0   223000.0  1.855000e+05
KTM                55000.0   860000.0  1.746697e+05
Kawasaki          110000.0  1100000.0  4.116246e+05
LML                 4400.0     4400.0  4.400000e+03
MV                950000.0  1500000.0  1.325000e+06
Mahindra           17800.0   175000.0  7.250709e+04
Rajdoot            75000.0    75000.0  7.500000e+04
Royal Enfield      33500.0   285000.0  9.856207e+04
Suzuki              8000.0  1260000.0  4.594683e+04
TVS                 5800.0   224000.0  4.429915e+04
Triumph           500000.0  1300000.0  8.274230e+05
Yamaha              9400.0  1550000.0  5.706896e+04
Yezdi              68000.0    68000.0  6.800000e+04

In [69]:

num_col = dt.select_dtypes(exclude='O')
num_col.head() #numerical column

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0
2  600000.0       110.0  8.0  675.0
3   65000.0     16329.0  4.0  180.0
4   80000.0     10000.0  3.0  150.0

In [70]:
#categorical column
cat_col = df.select_dtypes(include='O')
cat_col.head()

       Name Branch      City
0      Ritu     it    jaipur
1    Taniya    cse      agra
2  abhishek     it  vridavan
3    tanmay    ece   mathura
4    mayank    cse     gokul

In [71]:
df3 = pd.concat([cat_col,num_col],axis='columns') 
df3.head() #concatinating

       Name Branch      City     price  kms_driven  age  power
0      Ritu     it    jaipur   35000.0     17654.0  3.0  110.0
1    Taniya    cse      agra  119900.0     11000.0  4.0  350.0
2  abhishek     it  vridavan  600000.0       110.0  8.0  675.0
3    tanmay    ece   mathura   65000.0     16329.0  4.0  180.0
4    mayank    cse     gokul   80000.0     10000.0  3.0  150.0